orgmode_study_0.org
* org-mode
** 大纲
正在编写大纲,我们的队伍像太阳

我是下一行的内容

看看C-c C-n/p 能在大纲间进行切换么
** 轻量级标记语言
** org-mode 折叠大纲
S-Tab   循环切换整个文档的大纲状态(三种状态:折叠,打开下一级,打开全部)

Tab     循环切换光标所在大纲的状态
** org-mode 在大纲之间移动
C-c C-n/p   上/下一个标题

C-c C-f/b   上/下标题移动(仅限同级标题)

C-c C-u     跳到上一级标题

C-c C-j     切换到大纲状态浏览
**  基于大纲的编辑
M-RET   插入一个同级标题

M-S-RET 插入一个同级TODO标题

M-LEFT/RIGHT 将子树升/降级

M-S-UP/DOWN  将子树上/下移(相当于交换位置)
** 更多的快捷键可以通过C-c C-x C-h 查看
** 编辑时使用的字体
*粗体*

/斜体/

+删除线+

_下划线_

下标: H_2 O

上标: E = mc^2

等宽字: =git= 或者 ~git~
** 表格
org能够很容易的处理ASCII文本表格.
| 命令     | 描述                          |
|----------+-------------------------------|
| C-c RET  | 直接生成表结构                |
|----------+-------------------------------|
| Tab      | 移动到下一区域,必要时新建一行 |
|----------+-------------------------------|
| C-c 竖线 | 创建或转换成表格      |
|----------+-------------------------------|
| S-Tab    | 移动到上一区域  |
|----------+-------------------------------|
| RET      | 移动到下一行,必要时新建一行   |
|----------+-------------------------------|
** 编辑行和列

| 命令           | 描述                       |
|----------------+----------------------------|
| M-Left/Right   | 移动列                     |
|----------------+----------------------------|
| M-Up/Down      | 移动行                     |
|----------------+----------------------------|
| M-S-Left/Right | 删除/插入列                |
|----------------+----------------------------|
| M-S-Up/Down    | 删除/插入行                |
|----------------+----------------------------|
| C-c -          | 添加水平分割线             |
|----------------+----------------------------|
| C-c RET        | 添加水平分割线并跳到下一行 |
|----------------+----------------------------|
| C-c ^          | 根据当前列排序,可以选择排序方式           |
|----------------+----------------------------|
** 段落
对于单个回车换行的文本,认为其属于同一个段落。在导出的时候将会转化为不换行的同一段。如果要新起一个段落，需要留出一个空行

** 列表
Org能够识别有序列表、无需列表和描述列表
-无序列表以'-'、'+'或者'*'开头
-有序列表以'1.'或者'1)'开头
-描述列表用'::'将项和描述分开
-有序列表和无序列表都以缩进表示层级,只要对齐缩进,不管是换行还是分块都认为是处于当前列表
同一列表中的项的第一行必须缩进相同程度。当下一行的缩进与列表项的的开头的符号或者数字相同或者更小时，这一项就结束了。当所有的项都关上时，或者后面有两个空行 时，列表就结束了。例如：

My favorite scenes are (in this order)
1. The attack of the Rohirrim
2. Eowyn’s fight with the witch king
+ this was already my favorite scene in the book
+ I really like Miranda Otto.
Important actors in this film are:
- Elijah Wood :: He plays Frodo
- Sean Austin :: He plays Sam, Frodo’s friend.

* 可以导出其他格式
支持html,pdf等格式
** 导出命令
C-c C-e a    导出为文本文件

C-c C-e h    导出为html文件
* 本文内容来源
http://www.chawenti.com/articles/479.html
* Org-Mode 手册地址
http://orgmode.org/org.html

