orgmode_study_0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>orgmode_study_0</title>
<!-- 2016-03-08 Tue 01:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dai" />
</head>
<body>
<div id="content">
<h1 class="title">orgmode_study_0</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. org-mode</a>
<ul>
<li><a href="#sec-1-1">1.1. 大纲</a></li>
<li><a href="#sec-1-2">1.2. 轻量级标记语言</a></li>
<li><a href="#sec-1-3">1.3. org-mode 折叠大纲</a></li>
<li><a href="#sec-1-4">1.4. org-mode 在大纲之间移动</a></li>
<li><a href="#sec-1-5">1.5. 基于大纲的编辑</a></li>
<li><a href="#sec-1-6">1.6. 更多的快捷键可以通过C-c C-x C-h 查看</a></li>
<li><a href="#sec-1-7">1.7. 编辑时使用的字体</a></li>
<li><a href="#sec-1-8">1.8. 表格</a></li>
<li><a href="#sec-1-9">1.9. 编辑行和列</a></li>
<li><a href="#sec-1-10">1.10. 段落</a></li>
<li><a href="#sec-1-11">1.11. 列表</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 可以导出其他格式</a>
<ul>
<li><a href="#sec-2-1">2.1. 导出命令</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 本文内容来源</a></li>
<li><a href="#sec-4">4. Org-Mode 手册地址</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> org-mode</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 大纲</h3>
<div class="outline-text-3" id="text-1-1">
<p>
正在编写大纲,我们的队伍像太阳
</p>

<p>
我是下一行的内容
</p>

<p>
看看C-c C-n/p 能在大纲间进行切换么
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 轻量级标记语言</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> org-mode 折叠大纲</h3>
<div class="outline-text-3" id="text-1-3">
<p>
S-Tab   循环切换整个文档的大纲状态(三种状态:折叠,打开下一级,打开全部)
</p>

<p>
Tab     循环切换光标所在大纲的状态
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> org-mode 在大纲之间移动</h3>
<div class="outline-text-3" id="text-1-4">
<p>
C-c C-n/p   上/下一个标题
</p>

<p>
C-c C-f/b   上/下标题移动(仅限同级标题)
</p>

<p>
C-c C-u     跳到上一级标题
</p>

<p>
C-c C-j     切换到大纲状态浏览
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 基于大纲的编辑</h3>
<div class="outline-text-3" id="text-1-5">
<p>
M-RET   插入一个同级标题
</p>

<p>
M-S-RET 插入一个同级TODO标题
</p>

<p>
M-LEFT/RIGHT 将子树升/降级
</p>

<p>
M-S-UP/DOWN  将子树上/下移(相当于交换位置)
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 更多的快捷键可以通过C-c C-x C-h 查看</h3>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 编辑时使用的字体</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<b>粗体</b>
</p>

<p>
<i>斜体</i>
</p>

<p>
<del>删除线</del>
</p>

<p>
<span class="underline">下划线</span>
</p>

<p>
下标: H<sub>2</sub> O
</p>

<p>
上标: E = mc<sup>2</sup>
</p>

<p>
等宽字: <code>git</code> 或者 <code>git</code>
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 表格</h3>
<div class="outline-text-3" id="text-1-8">
<p>
org能够很容易的处理ASCII文本表格.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-c RET</td>
<td class="left">直接生成表结构</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Tab</td>
<td class="left">移动到下一区域,必要时新建一行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">C-c 竖线</td>
<td class="left">创建或转换成表格</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">S-Tab</td>
<td class="left">移动到上一区域</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">RET</td>
<td class="left">移动到下一行,必要时新建一行</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 编辑行和列</h3>
<div class="outline-text-3" id="text-1-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">M-Left/Right</td>
<td class="left">移动列</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">M-Up/Down</td>
<td class="left">移动行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">M-S-Left/Right</td>
<td class="left">删除/插入列</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">M-S-Up/Down</td>
<td class="left">删除/插入行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">C-c -</td>
<td class="left">添加水平分割线</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">C-c RET</td>
<td class="left">添加水平分割线并跳到下一行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">C-c ^</td>
<td class="left">根据当前列排序,可以选择排序方式</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 段落</h3>
<div class="outline-text-3" id="text-1-10">
<p>
对于单个回车换行的文本,认为其属于同一个段落。在导出的时候将会转化为不换行的同一段。如果要新起一个段落，需要留出一个空行
</p>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> 列表</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Org能够识别有序列表、无需列表和描述列表
-无序列表以'-'、'+'或者'*'开头
-有序列表以'1.'或者'1)'开头
-描述列表用'::'将项和描述分开
-有序列表和无序列表都以缩进表示层级,只要对齐缩进,不管是换行还是分块都认为是处于当前列表
同一列表中的项的第一行必须缩进相同程度。当下一行的缩进与列表项的的开头的符号或者数字相同或者更小时，这一项就结束了。当所有的项都关上时，或者后面有两个空行 时，列表就结束了。例如：
</p>

<p>
My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim
</li>
<li>Eowyn’s fight with the witch king
</li>
<li>this was already my favorite scene in the book
</li>
<li>I really like Miranda Otto.
</li>
</ol>
<p>
Important actors in this film are:
</p>
<dl class="org-dl">
<dt> Elijah Wood </dt><dd>He plays Frodo
</dd>
<dt> Sean Austin </dt><dd>He plays Sam, Frodo’s friend.
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 可以导出其他格式</h2>
<div class="outline-text-2" id="text-2">
<p>
支持html,pdf等格式
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 导出命令</h3>
<div class="outline-text-3" id="text-2-1">
<p>
C-c C-e a    导出为文本文件
</p>

<p>
C-c C-e h    导出为html文件
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 本文内容来源</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://www.chawenti.com/articles/479.html">http://www.chawenti.com/articles/479.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Org-Mode 手册地址</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://orgmode.org/org.html">http://orgmode.org/org.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dai</p>
<p class="date">Created: 2016-03-08 Tue 01:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
